Write data to file :to_csv method
ใช้สำหรับการนำข้อมูล DataFrame บันทึกลงในไฟล์

In [1]:
import pandas as pd

import os
os.chdir("/Users/phutharesuanwachirapisut/Programming/Dataset")

ให้ upload ไฟล์ ex4.csv เข้ามาก่อน จึงจะใช้คำสั่งถัดไปได้

In [2]:
result=pd.read_csv('ex4.csv')
result

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

อ่านไฟล์แล้วแสดงผลทางจอภาพ ใช้ sys.stdout ต้อง import sys

In [3]:
import sys
result.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|see you

In [4]:
result.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,see you

นำข้อมูลบันทึกลงไฟล์ภายใต้ attribute ต่างๆ

In [5]:
import pandas as pd
import numpy as np
# from google.colab import files

In [6]:
# upload=files.upload()

In [7]:
result=pd.read_csv('ex4.csv')
result

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

In [8]:
result.to_csv('out.i',index=False)

In [9]:
pd.read_csv('out.csv')

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

In [10]:
result.to_csv('out1.csv')
pd.read_csv('out1.csv')

   Unnamed: 0 something  a   b     c   d  message
0           0       one  1   2   3.0   4      NaN
1           1       two  5   6   NaN   8    world
2           2     three  9  10  11.0  12  see you

นำข้อมูลบันทึกลงไฟล์ภายใต้ attribute ต่างๆ

In [11]:
result.to_csv('out2.csv',index=False,columns=['a','b','c','d'])
pd.read_csv('out2.csv')

   a   b     c   d
0  1   2   3.0   4
1  5   6   NaN   8
2  9  10  11.0  12

In [12]:
import sys
result.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|see you

In [13]:
result.to_csv(sys.stdout,sep='|',na_rep='NULL')

|something|a|b|c|d|message
0|one|1|2|3.0|4|NULL
1|two|5|6|NULL|8|world
2|three|9|10|11.0|12|see you

In [14]:
result.to_csv('out3.csv',na_rep='NULL',index=False)
pd.read_csv('out3.csv')

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8    world
2     three  9  10  11.0  12  see you

นำข้อมูลบันทึกลงไฟล์ภายใต้ attribute ต่างๆ

In [15]:
result.to_csv(sys.stdout,index=False,header=False) #ไม่แสดง index และ header

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,see you

In [16]:
result.to_csv(sys.stdout,index=False,columns=['a','b','c']) #เลือกเฉพาะ columns , มีการแสดง index

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [17]:
result.to_csv('out4.txt',index=False,header=False)
data=pd.read_csv('out4.txt',header=None)
data

       0  1   2     3   4        5
0    one  1   2   3.0   4      NaN
1    two  5   6   NaN   8    world
2  three  9  10  11.0  12  see you

Working with Delimited Formats

สำหรับไฟล์ที่ใช้ delimiter ที่เป็น single-character เราสามารถใช้ Python’s built-in csv module ต่างๆ เช่น
csv.reader() ใช้เพื่อเปิดอ่านไฟล์

In [18]:
import csv
f=open('ex4.csv')
reader=csv.reader(f)
for line in reader:
  print(line)

['something', 'a', 'b', 'c', 'd', 'message']
['one', '1', '2', '3', '4', 'NA']
['two', '5', '6', '', '8', 'world']
['three', '9', '10', '11', '12', 'see you']

ข้อมูลที่ได้จะอยู่ในรูปแบบของ tuple ที่มีการ remove quote characters ออกไปแล้ว โดยเราสามารถดึงทีละบรรทัดได้
ซึ่ง 1 บรรทัดจะเก็บเป็น 1 tuple

ขั้นตอนของการจัดการ wrangling data

1) Read the file into a list of lines

In [19]:
with open('ex4.csv') as f:
  lines=list(csv.reader(f))

2) Split the lines into the header line and the data lines

In [20]:
header,values=lines[0],lines[1:]

กรณีที่เรียกค่าที่เก็บออกมาจะพบค่าที่ได้เป็นดังนี้

In [21]:
header

['something', 'a', 'b', 'c', 'd', 'message']

In [22]:
values

[['one', '1', '2', '3', '4', 'NA'],
 ['two', '5', '6', '', '8', 'world'],
 ['three', '9', '10', '11', '12', 'see you']]

3) Then we can create a dictionary of data columns using a dictionary comprehension and the expression zip(*values), which transposes rows to columns.

In [23]:
data_dict={h: v for h, v in zip(header,zip(*values))}
data_dict

{'something': ('one', 'two', 'three'),
 'a': ('1', '5', '9'),
 'b': ('2', '6', '10'),
 'c': ('3', '', '11'),
 'd': ('4', '8', '12'),
 'message': ('NA', 'world', 'see you')}

CSV files come in many different flavors. To define a new format with a different delimiter, string quoting convention, or line terminator, we define a simple subclass of csv.Dialect.

In [24]:
import csv
f=open('ex4.csv')
class my_dialect(csv.Dialect):
  lineterminator='\n'
  delimiter=';'
  quotechar='"'
  quoting=csv.QUOTE_MINIMAL

reader1=csv.reader(f,dialect=my_dialect)

In [25]:
import csv
f=open('ex4.csv')
class my_dialect(csv.Dialect):
  lineterminator='\n'
  delimiter=','
  quotechar='"'
  quoting=csv.QUOTE_MINIMAL

reader2=csv.reader(f,dialect=my_dialect)

เมื่อขอแสดงค่าข้อมูลที่อ่านได้ในแต่ละบรรทัด

In [26]:
for line in reader1:
  print(line)

['something,a,b,c,d,message']
['one,1,2,3,4,NA']
['two,5,6,,8,world']
['three,9,10,11,12,see you']

In [27]:
for line in reader2:
  print(line)

['something', 'a', 'b', 'c', 'd', 'message']
['one', '1', '2', '3', '4', 'NA']
['two', '5', '6', '', '8', 'world']
['three', '9', '10', '11', '12', 'see you']

In [28]:
import csv  #อ่านโดยไม่ใช้ csv.Dialect
f=open('ex4.csv')
reader=csv.reader(f)
for line in reader:
  print(line)

['something', 'a', 'b', 'c', 'd', 'message']
['one', '1', '2', '3', '4', 'NA']
['two', '5', '6', '', '8', 'world']
['three', '9', '10', '11', '12', 'see you']

We can also give individual CSV dialect parameters as keywords to csv.reader without having to define a subclass.
เช่น reader = csv.reader(f,  delimiter='|')

In [29]:
import csv
f=open('ex4.csv')
reader = csv.reader(f, delimiter='|')
for line in reader:
  print(line)

['something,a,b,c,d,message']
['one,1,2,3,4,NA']
['two,5,6,,8,world']
['three,9,10,11,12,see you']

To write delimited files manually, you can use csv.writer. It accepts an open, writable file object and the same dialect and format options as csv.reader.

In [30]:
with open('mydata.csv','w') as f:
  writer=csv.writer(f,dialect=my_dialect)
  writer.writerow(('one','two','three'))
  writer.writerow(('1','2','3'))
  writer.writerow(('4','5','6'))
  writer.writerow(('7','8','9'))

In [31]:
f1=open('mydata.csv')
reader=csv.reader(f1)
for line in reader:
  print(line)

['one', 'two', 'three']
['1', '2', '3']
['4', '5', '6']
['7', '8', '9']

JSON Data

Key ของ dict ใน JSON จะเป็น string เสมอ(มีเครื่องหมาย "")

In [32]:
obj="""
{"name":"Wes",
"places_lived":["United States","Spain","Germany"],
"pet":null,
"siblings": [{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},
{"name":"Katie","age":38,
"pets":["Sixes","Stache","Cisco"]}]
}
"""

In [33]:
obj

'\n{"name":"Wes",\n"places_lived":["United States","Spain","Germany"],\n"pet":null,\n"siblings": [{"name":"Scott","age":30,"pets":["Zeus","Zuko"]},\n{"name":"Katie","age":38,\n"pets":["Sixes","Stache","Cisco"]}]\n}\n'

In [34]:
import json
result=json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

json.dumps converts a Python object back to JSON.

In [35]:
asjson=json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [36]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [37]:
siblings1=pd.DataFrame(result['siblings'],columns=['name','pets'])
siblings1

    name                    pets
0  Scott            [Zeus, Zuko]
1  Katie  [Sixes, Stache, Cisco]


JSON Data

In [38]:
ab=[{1:2.3,'a':('b','c')},None,False,True]
print(json.dumps(ab))

[{"1": 2.3, "a": ["b", "c"]}, null, false, true]

หากใส่ object ที่นอกเหนือจากข้างต้นจะไม่สามารถแปลงได้

In [39]:
def set_default(obj):
    if isinstance(obj, set):
        return list(obj)
    raise TypeError
print(json.dumps({2,1}, default=set_default))

[1, 2]

แต่ถ้าข้อมูลนั้นไม่มีในขอบเขตที่ JSON รับได้สามารถแก้ไขได้โดยใช้ตัวเลือก default เพื่อระบุว่าข้อมูลนั้นเป็น list, str หรืออะไรบางอย่างที่ให้สามารถแปลงเป็น JSON ได้ เช่น

In [40]:
print(json.dumps([{2,1}],default=list))

[[1, 2]]

In [41]:
print(json.dumps([{1,2},2],default=list))
print(json.dumps([{1,2},2],default=str))
print(json.dumps([{1,2},2],default=sum))
print(json.dumps([{1,2},2],default=lambda x: '@'.join([str(s) for s in x])))

[[1, 2], 2]
["{1, 2}", 2]
[3, 2]
["1@2", 2]

In [42]:
import pandas as pd
import numpy as np
import io

# from google.colab import files
# uploaded=files.upload()

In [43]:
data=pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [44]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [45]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]